    #вариант:1 номер_1
a=[3,4,6,1]  #массив a
b=[8,6,9,5]  #массив b
c=[4,7,2,3]  #массив c
def summa():
    print('сумма элементов массива a=',sum(a),'среднеарифметическое a=',sum(a)/len(a))
    print('сумма элементов массива b=',sum(b),'среднеарифметическое b=',sum(b)/len(b))
    print('сумма элементов массива c=',sum(c),'среднеарифметическое c=',sum(c)/len(c))
summa()  #вывод суммы каждого массива
print('номер 2')  #номер 2
x=int(input('введите число'))
y=int(input('введите число'))
def shapes():
    print('прямоугольник=',x*y)
    print('прям.треугольник=',0.5*x*y)
    print('квадрат=',x*x)
shapes()














